<template>
    <div class="container">
        <thirdHeader :msgHeader="msg" :H5brek="true"></thirdHeader>
        <div class="acc" v-show="acc">
            <h2>1、如何成功注册并登录幼趣魔方APP？</h2>
            <p>幼趣魔方App的注册采取“邀请制”，每一位用户注册幼趣魔方账号，需要选择自己所属的幼儿园群组，并输入管理员设定的邀请码，才能通过审核。如果您是管理员，请您在注册时，提供相关的管理员认证信息，并设置通行码，过审后，您可将通行码告知园所内的其他老师，邀请他们进行注册。</p>
            <h2>2、如何修改通行码？</h2>
            <p>如果您是管理员身份，可以在【我的园】的【成员中心】中进行修改通行码的操作。具体操作：点击我的园—点击成员中心—点击自己头像右侧的操作按钮—点击修改通行码—修改。如果您不是管理员的身份，即没有权限进行通行码的修改操作。</p>
            <h2>3、如何更改密码？</h2>
            <p>进入【我的园】，点击【我的设置】，您可以在这里看到【修改密码】的选项。点击此选项，输入旧密码和新密码后，确认即可完成密码更换。</p>
            <h2>4、如何更改已绑定的手机号？</h2>
            <p>进入【我的园】，点击【我的设置】，您可以在这里看到【更换手机号】的选项。点击此选项，输入旧手机号和登录密码，点击确认，再输入新的手机号即可完成手机号更换。</p>
        </div>
        <div class="buy" v-show="buy">
            <h2>1、预订单是什么意思？</h2>
            <p>预订单并非最终的确认订单，而是由您提交后，我们进行审核并与您联系，经过确认无误后，由客服确认的订单才是最终的已确认订单。在您提交预订单后，在客服与您联系的过程中，您有权进行修改或取消订单。</p>
            <h2>2、商品不想要了怎么取消订单？</h2>
           <!-- <p>幼趣魔方App不支持用户主动取消订单哦，如若您错拍或者想取消订单，请第一时间与客服沟通并协商。客服电话：15201356961。</p>  -->
			<p>幼趣魔方App不支持用户主动取消订单哦，如若您错拍或者想取消订单，请第一时间与客服沟通并协商。客服电话：<a href="tel:15201356961" >15201356961</a>。</p>
            <h2>3、购买的商品出现质量问题怎么办？</h2>
            <p>玩教具：如有非人为破坏和不可抗力因素导致的质量问题，一年内可免费换新，三年内免费上门维修。</p>
            <h2>4、配送的流程是怎样的？</h2>
            <p>（1）发货:订单确认后，客服将第一时间联系您沟通具体的送货时间，拟出送货单，司机在规定时间内进行配送。
（2）验货：我们的每一款产品都是经过仔细质检后才发货，为了保障您的权益，签收时请仔细检查，如遇破损、错发等情况，请立即与客服联系，我们会迅速协助处理。如没有问题请您在送货单签字完成整个交易流程。</p>
        </div>
        <div class="page" v-show="page">
            <h2>1、网络很好，为什么页面依然加载失败？</h2>
            <p>个人网络良好的情况下，有时也会存在短暂的与App服务器连接不上的情况，就会导致页面加载空白。遇到此种情况，建议您退出当前页面，或者退出App后台，重新刷新进入即可。<br/>如果在WiFi环境下，网络情况则比较复杂，一些WiFi会对个别网络链接作出限制（如校园网），此时建议您切换WiFi／个人流量，重新刷新页面，看看是否正常。<br/> 如果按上述方法，页面均无法恢复正常，辛苦您将异常页面截图，并在线联系客服协助解决。</p>
            <h2>2、字体太小，看不清怎么办？</h2>
            <p>页面字体大小为固定适配，如果您觉得字体过小，可以前往手机【设置】中心，进行字体大小调整。</p>
        </div>
        <div class="firm" v-show="firm">
            <h2>1、如何申请开具发票？</h2>
            <p>从确认订单的第一个工作日起，幼趣魔方 App官方将依据您的订单拟定合同与开具发票。合同将在一周之内由客服在线发送给您进行确认，如有更改请与客服协商沟通。我们将在货品配送完成后的一周之内联系您完成合同签订与发票寄送。</p>
            <h2>2、开票周期</h2>
            <p>一般情况下，我们在您下单之后的25个工作日内开具发票。如您有特殊需求，请您联系客服说明。</p>
        </div>
        <div class="other" v-show="other">
            <h2>1、分享到园收藏的商品为什么没有了？</h2>
            <p>【园收藏】功能支持的商品收藏数量上限为30个，每一款商品被加进园收藏后，可保留7天的有效查看期。若您分享到园收藏的商品消失不见了，可能存在3种情况：（1）该商品已下架；（2）该商品超过了园收藏展示期；（3）该商品已被管理员从园收藏中移除。</p>
            <h2>2、维修到园费用说明</h2>
            <p>视维修部件破损情况而定。</p>
            <h2>3、约买手服务是什么？</h2>
            <p>约买手是幼趣魔方App的一个特色服务，您可以将平日需要采买，却在App上未曾找到的商品记录下来，统一在这里提交预约采买。提交订单后，客服会主动和您采取联络，根据您的需求进行确认和调整。</p>
        </div>
    </div>
</template>

<script>
    import thirdHeader from '../components/thirdHeader'
    export default {
        name: "helpDet",
        data(){
          return{
              stCode:"",
              msg:"",
              acc:false,
              buy:false,
              page:false,
              firm:false,
              other:false,
          }
        },
        created(){
            this.stCode = this.$route.params.type;
            if(this.stCode === "acc"){
                this.msg = "账号问题";
                this.acc = true
            }else if(this.stCode === "buy"){
                this.msg = "购买问题";
                this.buy = true
            }else if(this.stCode === "page"){
                this.msg = "页面问题";
                this.page = true
            }else if(this.stCode === "firm"){
                this.msg = "发票问题";
                this.firm = true
            }else if(this.stCode === "other"){
                this.msg = "其他问题";
                this.other = true
            }
        },
        components:{
            thirdHeader
        }
    }
</script>

<style scoped lang="scss">
.container{
    padding-bottom: 88px;/*px*/
}
    h2{
        padding: 40px 32px;/*px*/
		 font-size: 35px;/*px*/
    }
	a{
		color: black;
	}
    p{
        padding: 12px 32px;/*px*/
        letter-spacing: 1px;
        font-size: 30px;/*px*/
    }
</style>